
//ジャンルの配列データ
function contentData(grade, subject) {
    switch(grade) {
        case "第1学年":
            switch(subject) {
                case "国語":
                    return [
                        "ひらがな",
                        "カタカナ",
                        "漢字",
                        "語句",
                        "文章題",
                        "物語",
                        "説明文",
                        "詩"
                    ];
                    break;
                case "算数":
                    return [
                        "10までの数",
                        "10以上の数",
                        "足し算",
                        "引き算",
                        "順序",
                        "時計・時刻",
                        "立体"
                    ];
                    break;
                case "生活":
                    return [
                        "学校と生活",
                        "家庭と生活",
                        "地域と生活",
                        "公共施設の利用",
                        "季節の変化と生活",
                        "自然や物を使った遊び",
                        "飼育",
                        "栽培",
                        "生活や出来事",
                        "自分の成長"
                    ];
                    break;
                case "音楽":
                    return [
                        "歌",
                        "楽器",
                        "音楽の知識",
                        "リズム遊び"
                    ];
                    break;
                case "図工":
                    return [
                        "造形遊び",
                        "絵",
                        "工作",
                        "立体",
                        "鑑賞する活動"
                    ];
                    break;
                case "体育":
                    return [
                        "体づくり",
                        "器械運動",
                        "走・跳の運動",
                        "水遊び",
                        "ゲーム",
                        "表現"
                    ];
                    break;
                case "書道":
                    return [
                        "姿勢",
                        "筆の持ち方",
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "努力",
                        "善悪の判断",
                        "正直",
                        "礼儀",
                        "思いやり",
                        "友情",
                        "感謝",
                        "生命",
                        "自然愛",
                        "畏敬の念",
                        "規則尊重",
                        "勤労",
                        "家族愛",
                        "愛校心",
                        "郷土愛"
                    ];
                    break;
            }
            break;
        case "第2学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "文章題",
                        "物語",
                        "説明文",
                        "詩"
                    ];
                    break;
                case "算数":
                    return [
                        "表・グラフ",
                        "足し算",
                        "引き算",
                        "ひっ算",
                        "1000までの数",
                        "長さの単位"
                    ];
                    break;
                case "生活":
                    return [
                        "学校と生活",
                        "家庭と生活",
                        "地域と生活",
                        "公共施設の利用",
                        "季節の変化と生活",
                        "自然や物を使った遊び",
                        "動物の飼育",
                        "植物の栽培",
                        "生活や出来事の伝え合い",
                        "自分の成長"
                    ];
                    break;
                case "音楽":
                    return [
                        "歌",
                        "楽器",
                        "音楽の知識",
                        "リズム遊び"
                    ];
                    break;
                case "図工":
                    return [
                        "造形遊び",
                        "絵",
                        "工作",
                        "立体",
                        "鑑賞する活動"
                    ];
                    break;
                case "体育":
                    return [
                        "体づくり",
                        "器械運動",
                        "走・跳の運動",
                        "水遊び",
                        "ゲーム",
                        "表現"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "努力",
                        "善悪の判断",
                        "正直",
                        "礼儀",
                        "思いやり",
                        "友情",
                        "感謝",
                        "生命",
                        "自然愛",
                        "畏敬の念",
                        "規則尊重",
                        "勤労",
                        "家族愛",
                        "愛校心",
                        "郷土愛"
                    ];
                    break;
            }
            break;
        case "第3学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "文章題",
                        "物語",
                        "説明文",
                        "詩"
                    ];
                    break;
                case "算数":
                    return [
                        "水のかさ",
                        "図形",
                        "掛け算",
                        "時間",
                        "割り算",
                        "倍",
                        "足し算",
                        "引き算",
                        "表・グラフ",
                        "長さの単位",
                        "道のり",
                        "大きい数",
                        "円と球"];
                    break;
                case "理科":
                    return [
                        "生き物",
                        "植物",
                        "風",
                        "太陽",
                        "光",
                        "音",
                        "重さ"
                    ];
                    break;
                case "社会":
                    return [
                        "わたしたちのまち",
                        "街の仕事",
                        "むかしのくらし",
                        "安心・安全",
                        "みんなのくらし",
                        "地域",
                        "都道府県"
                    ];
                    break;
                case "英語":
                    return [
                        "アルファベット",
                        "英単語",
                        "あいさつ",
                        "数字",
                        "質問",
                        "言語発表"
                    ];
                    break;
                case "音楽":
                    return [
                        "歌",
                        "楽器",
                        "音楽の知識",
                        "リズム遊び"
                    ];
                    break;
                case "図工":
                    return [
                        "造形遊び",
                        "絵",
                        "工作",
                        "立体",
                        "鑑賞する活動"
                    ];
                    break;
                case "体育":
                    return [
                        "体づくり運動",
                        "器械運動",
                        "走・跳の運動",
                        "水泳運動",
                        "ゲーム",
                        "表現運動・ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "健康",
                        "体の成長"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "粘り強さ",
                        "善悪の判断",
                        "正直",
                        "個性",
                        "礼儀",
                        "思いやり",
                        "信頼友情",
                        "尊敬",
                        "感謝",
                        "生命尊重",
                        "自然愛",
                        "動物愛護",
                        "畏敬の念",
                        "規則尊重",
                        "公徳心",
                        "勤労",
                        "家族愛",
                        "愛校心",
                        "郷土愛",
                        "愛国心",
                        "国際理解"
                    ];
                    break;
            }
            break;
        case "第4学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "文章題",
                        "物語",
                        "説明文",
                        "詩"
                    ];
                    break;
                case "算数":
                    return [
                        "大きい数",
                        "折れ線グラフ",
                        "割り算",
                        "角",
                        "垂直",
                        "平行",
                        "倍数",
                        "四捨五入",
                        "少数",
                        "カッコ",
                        "加減乗除",
                        "面積"];
                    break;
                case "理科":
                    return [
                        "季節",
                        "気温",
                        "体のつくり",
                        "電気",
                        "月の観察",
                        "ものの温度",
                        "水のすがた"
                    ];
                    break;
                case "社会":
                    return [
                        "わたしたちのまち",
                        "街の仕事",
                        "むかしのくらし",
                        "安心・安全",
                        "みんなのくらし",
                        "地域",
                        "都道府県"
                    ];
                    break;
                case "英語":
                    return [
                        "アルファベット",
                        "英単語",
                        "あいさつ",
                        "数字",
                        "質問",
                        "言語発表"
                    ];
                    break;
                case "音楽":
                    return [
                        "歌",
                        "楽器",
                        "音楽の知識",
                        "リズム遊び"
                    ];
                    break;
                case "図工":
                    return [
                        "造形遊び",
                        "絵",
                        "工作",
                        "立体",
                        "鑑賞する活動"
                    ];
                    break;
                case "体育":
                    return [
                        "体づくり",
                        "器械運動",
                        "走・跳の運動",
                        "水泳運動",
                        "ゲーム",
                        "表現運動",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "けんこう",
                        "体の成長"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "粘り強さ",
                        "善悪の判断",
                        "正直",
                        "個性",
                        "礼儀",
                        "思いやり",
                        "信頼友情",
                        "尊敬",
                        "感謝",
                        "生命尊重",
                        "自然愛",
                        "動物愛護",
                        "畏敬の念",
                        "規則尊重",
                        "公徳心",
                        "勤労",
                        "家族愛",
                        "愛校心",
                        "郷土愛",
                        "愛国心",
                        "国際理解"
                    ];
                    break;
            }
            break;
        case "第5学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "文章題",
                        "物語",
                        "説明文",
                        "古文",
                        "詩",
                        "言葉のきまり",
                        "品詞"
                    ];
                    break;
                case "算数":
                    return [
                        "少数",
                        "合同",
                        "比例",
                        "平均",
                        "単位",
                        "足し算",
                        "引き算",
                        "掛け算",
                        "割り算",
                        "内角",
                        "公倍数",
                        "公約数",
                        "割合"　
                    ];
                    break;
                case "理科":
                    return [
                        "天気",
                        "植物",
                        "振り子",
                        "自然災害",
                        "電流",
                        "生命の誕生",
                        "もののとけかた"
                    ];
                    break;
                case "社会":
                    return [
                        "地図",
                        "食料",
                        "工業生産",
                        "情報",
                        "自然環境"
                    ];
                    break;
                case "英語":
                    return [
                        "アルファベット",
                        "英単語",
                        "あいさつ",
                        "数字",
                        "質問",
                        "言語発表"
                    ];
                    break;
                case "家庭":
                    return [
                        "生活",
                        "調理",
                        "針と糸",
                        "持続可能",
                        "食事",
                        "住居",
                        "家族の時間",
                        "ミシン"
                    ];
                    break;
                case "音楽":
                    return [
                        "歌",
                        "楽器",
                        "音楽の知識",
                        "リズム遊び"
                    ];
                    break;
                case "図工":
                    return [
                        "造形遊び",
                        "絵",
                        "工作",
                        "立体",
                        "鑑賞する活動"
                    ];
                    break;
                case "体育":
                    return [
                        "体づくり",
                        "器械運動",
                        "走・跳の運動",
                        "水泳運動",
                        "ゲーム",
                        "表現運動",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "健康",
                        "けがの防止",
                        "病気の予防"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "基本的な生活習慣","節度節制",
                        "希望","勇気","努力",
                        "自由","自律","責任",
                        "誠実",
                        "真理愛","創意工夫",
                        "個性",
                        "礼儀",
                        "思いやり",
                        "信頼友情","男女協力",
                        "寛容",
                        "尊敬","感謝",
                        "生命尊重",
                        "自然愛","環境保全",
                        "畏敬の念",
                        "規則尊重","公徳心","権利義務",
                        "公正公平","正義",
                        "役割と責任の自覚",
                        "勤労","奉仕",
                        "家族愛",
                        "愛校心",
                        "郷土愛","愛国心",
                        "国際理解","親善"
                    ];
                    break;
            }
            break;
        case "第6学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "文章題",
                        "物語",
                        "説明文",
                        "古文",
                        "詩",
                        "言葉のきまり","品詞"
                    ];
                    break;
                case "算数":
                    return [
                        "文字と式",
                        "分数",
                        "少数",
                        "点対称","線対称",
                        "円",
                        "立体",
                        "比",
                        "拡大図","縮図",
                        "比例","反比例"
                    ];
                    break;
                case "理科":
                    return [
                        "ものの燃え方",
                        "ヒトや動物の身体",
                        "植物の体",
                        "空気・水",
                        "てこの原理",
                        "土地","地層",
                        "災害",
                        "月","太陽",
                        "水溶液",
                        "電気"
                    ];
                    break;
                case "社会":
                    return [
                        "国の成り立ち",
                        "くらしと政治",
                        "グローバル化"
                    ];
                    break;
                case "英語":
                    return [
                        "アルファベット",
                        "英単語",
                        "あいさつ",
                        "数字",
                        "質問",
                        "言語発表"
                    ];
                    break;
                case "家庭":
                    return [
                        "生活",
                        "調理",
                        "針と糸",
                        "持続可能","お金の使い方",
                        "食事",
                        "住居",
                        "家族の時間",
                        "ミシン"
                    ];
                    break;
                case "音楽":
                    return [
                        "歌",
                        "楽器",
                        "音楽の知識",
                        "リズム遊び"
                    ];
                    break;
                case "図工":
                    return [
                        "造形遊び",
                        "絵",
                        "工作",
                        "立体",
                        "鑑賞する活動"
                    ];
                    break;
                case "体育":
                    return [
                        "体づくり",
                        "器械運動",
                        "走・跳の運動",
                        "水泳運動",
                        "ゲーム",
                        "表現運動",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "健康",
                        "けがの防止",
                        "病気の予防"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "基本的な生活習慣","節度節制",
                        "希望","勇気","努力",
                        "自由","自律","責任",
                        "誠実",
                        "真理愛","創意工夫",
                        "個性",
                        "礼儀",
                        "思いやり",
                        "信頼友情","男女協力",
                        "寛容",
                        "尊敬","感謝",
                        "生命尊重",
                        "自然愛","環境保全",
                        "畏敬の念",
                        "規則尊重","公徳心","権利義務",
                        "公正公平","正義",
                        "役割と責任の自覚",
                        "勤労","奉仕",
                        "家族愛",
                        "愛校心",
                        "郷土愛","愛国心",
                        "国際理解","親善"
                    ];
                    break;
            }
            break;
        case "中学校第1学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "品詞",
                        "文章題",
                        "小論文",
                        "文学作品",
                        "古文",
                        "漢文"
                    ];
                    break;
                case "数学":
                    return [
                        "整数",
                        "文字と式",
                        "一次方程式",
                        "比例",
                        "平面図形",
                        "空間図形"
                    ];
                    break;
                case "理科":
                    return [
                        "植物",
                        "動物",
                        "みのまわりの性質",
                        "身の回りの現象",
                        "大地",
                        "器具"
                    ];
                    break;
                case "地理":
                    return [
                        "世界の様々な地域"
                    ];
                    break;
                case "歴史":
                    return [
                        "歴史の移り変わり",
                        "原始","古代",
                        "中世",
                        "近世",
                        "日本と世界",
                    ];
                    break;
                case "英語":
                    return [
                        "I am ～","You are ～",
                        "This is ～","He is ～",
                        "日時","曜日","天気",
                        "一般動詞",
                        "冠詞","複数形",
                        "代名詞",
                        "三単現",
                        "命令文",
                        "疑問詞",
                        "現在進行形",
                        "can",
                        "前置詞",
                        "過去形"
                    ];
                    break;
                case "技術":
                    return [
                        "生物育成",
                        "コンピュータ",
                        "インターネット"
                    ];
                    break;
                case "家庭":
                    return [
                        "安全な住まい",
                        "衣服の取り扱い絵表示",
                        "洗濯",
                        "和食",
                        "食生活",
                        "バランスのとれた食生活",
                        "食品の選び方",
                        "環境に配慮した調理",
                        "快適な室内空間",
                        "生活を豊かにするための工夫",
                        "幼児教育",
                        "資源の有効利用"
                    ];
                    break;
                case "音楽":
                    return [
                        "音楽の基礎知識",
                        "音楽家",
                        "合唱",
                        "楽器"
                    ];
                    break;
                case "美術":
                    return [
                        "色",
                        "技法",
                        "作家・流派"
                    ];
                    break;
                case "体育":
                    return [
                        "球技",
                        "水泳",
                        "体操",
                        "卓上",
                        "陸上",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "新体力テスト","オリンピック",
                        "飲酒","喫煙","薬物乱用",
                        "感染症","エイズ",
                        "健康と環境",
                        "陸上"
                    ];
                    break;
                case "書道":
                    return [
                        "姿勢",
                        "筆の持ち方",
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "勇気","強い意志",
                        "自主自律",
                        "真理愛",
                        "向上心","個性",
                        "礼儀",
                        "人思いやり",
                        "信頼友情",
                        "異性の理解",
                        "謙虚",
                        "尊敬","感謝",
                        "生命尊重",
                        "自然愛","畏敬の念",
                        "弱さの克服","生きる喜び",
                        "法の順守","権利義務",
                        "公徳心",
                        "公正公平","正義",
                        "役割と責任の自覚",
                        "勤労","奉仕","公共の福祉",
                        "家族愛",
                        "愛校心",
                        "郷土愛",
                        "愛国心",
                        "国際理解","人類愛"
                    ];
                    break;
            }
            break;
        case "中学校第2学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "品詞",
                        "文章題",
                        "小論文",
                        "文学作品",
                        "古文",
                        "漢文"
                    ];
                    break;
                case "数学":
                    return [
                        "式と計算",
                        "一次不等式",
                        "連立方程式",
                        "一次関数",
                        "平行","合同",
                        "三角形","四角形",
                        "相似と比",
                        "資料統計"
                    ];
                    break;
                case "理科":
                    return [
                        "化学変化","分子","原子",
                        "植物",
                        "動物",
                        "電気",
                        "器具"
                    ];
                    break;
                case "地理":
                    return [
                        "地域"
                    ];
                    break;
                case "歴史":
                    return [
                        "近代",
                        "日本と世界"
                    ];
                    break;
                case "英語":
                    return [
                        "過去形","過去進行形",
                        "未来",
                        "接続詞",
                        "助動詞",
                        "There is ～",
                        "動名詞","不定詞",
                        "比較",
                        "受動態"
                    ];
                    break;
                case "技術":
                    return [
                        "生物育成",
                        "コンピュータ",
                        "インターネット"
                    ];
                    break;
                case "家庭":
                    return [
                        "安全な住まい",
                        "衣服の取り扱い絵表示",
                        "洗濯",
                        "和食",
                        "食生活",
                        "バランスのとれた食生活",
                        "食品の選び方",
                        "環境に配慮した調理",
                        "快適な室内空間",
                        "生活を豊かにするための工夫",
                        "幼児教育",
                        "資源の有効利用"
                    ];
                    break;
                case "音楽":
                    return [
                        "音楽の知識",
                        "音楽家",
                        "合唱",
                        "楽器"
                    ];
                    break;
                case "美術":
                    return [
                        "色",
                        "技法",
                        "作家","流派"
                    ];
                    break;
                case "体育":
                    return [
                        "球技",
                        "水泳",
                        "体操",
                        "卓上",
                        "陸上",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "新体力テスト","オリンピック",
                        "飲酒","喫煙","薬物乱用",
                        "感染症","エイズ",
                        "健康と環境",
                        "陸上"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "勇気","強い意志",
                        "自主自律",
                        "真理愛",
                        "向上心","個性",
                        "礼儀",
                        "人思いやり",
                        "信頼友情",
                        "異性の理解",
                        "謙虚",
                        "尊敬","感謝",
                        "生命尊重",
                        "自然愛","畏敬の念",
                        "弱さの克服","生きる喜び",
                        "法の順守","権利義務",
                        "公徳心",
                        "公正公平","正義",
                        "役割と責任の自覚",
                        "勤労","奉仕","公共の福祉",
                        "家族愛",
                        "愛校心",
                        "郷土愛",
                        "愛国心",
                        "国際理解","人類愛"
                    ];
                    break;
            }
            break;
        case "中学校第3学年":
            switch(subject) {
                case "国語":
                    return [
                        "漢字",
                        "語句",
                        "品詞",
                        "文章題",
                        "小論文",
                        "文学作品",
                        "古文",
                        "漢文"
                    ];
                    break;
                case "数学":
                    return [
                        "項式",
                        "平方根",
                        "数理数","無理数",
                        "二次方程式",
                        "関数",
                        "円",
                        "三平方の定理",
                        "相似",
                        "確率"
                    ];
                    break;
                case "理科":
                    return [
                        "化学変化","イオン",
                        "生命",
                        "運動","エネルギー",
                        "地球と宇宙",
                        "科学技術",
                        "自然",
                        "器具"];
                    break;
                case "歴史":
                    return [
                        "世界大戦",
                        "現代","日本と世界"
                    ];
                    break;
                case "公民":
                    return [
                        "現代社会",
                        "日本国憲法",
                        "民主政治",
                        "経済",
                        "安心",
                        "国際社会",
                    ];
                    break;
                case "英語":
                    return [
                        "現在完了",
                        "文型",
                        "疑問文",
                        "不定詞","構文",
                        "分詞",
                        "関係代名詞",
                        "仮定法"
                    ];
                    break;
                case "技術":
                    return [
                        "生物育成",
                        "コンピュータ",
                        "インターネット"
                    ];
                    break;
                case "家庭":
                    return [
                        "安全な住まい",
                        "衣服の取り扱い絵表示",
                        "洗濯",
                        "和食",
                        "食生活",
                        "バランスのとれた食生活",
                        "食品の選び方",
                        "環境に配慮した調理",
                        "快適な室内空間",
                        "生活を豊かにするための工夫",
                        "幼児教育",
                        "資源の有効利用"
                    ];
                    break;
                case "音楽":
                    return [
                        "知識",
                        "音楽家",
                        "合唱",
                        "楽器"
                    ];
                    break;
                case "美術":
                    return [
                        "色",
                        "技法",
                        "作家","流派"
                    ];
                    break;
                case "体育":
                    return [
                        "球技",
                        "水泳",
                        "体操",
                        "卓上",
                        "陸上",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "新体力テスト","オリンピック",
                        "飲酒","喫煙","薬物乱用",
                        "感染症","エイズ",
                        "健康と環境",
                        "陸上"
                    ];
                    break;
                case "書道":
                    return [
                        "筆使い",
                        "筆順",
                        "点画の組み立て",
                        "部分の組み立て",
                        "硬筆"
                    ];
                    break;
                case "道徳":
                    return [
                        "生活習慣",
                        "勇気","強い意志",
                        "自主自律",
                        "真理愛",
                        "向上心","個性",
                        "礼儀",
                        "人思いやり",
                        "信頼友情",
                        "異性の理解",
                        "謙虚",
                        "尊敬","感謝",
                        "生命尊重",
                        "自然愛","畏敬の念",
                        "弱さの克服","生きる喜び",
                        "法の順守","権利義務",
                        "公徳心",
                        "公正公平","正義",
                        "役割と責任の自覚",
                        "勤労","奉仕","公共の福祉",
                        "家族愛",
                        "愛校心",
                        "郷土愛",
                        "愛国心",
                        "国際理解","人類愛"
                    ];
                    break;
            }
            break;
        case "高等学校":
            switch(subject) {
                case "古文":
                    return [
                        "歴史的かな遣い",
                        "古語",
                        "現代語訳",
                        "品詞",
                        "動詞",
                        "形容詞","形容動詞",
                        "格助詞",
                        "助動詞",
                        "敬語",
                        "読解"
                    ];
                    break;
                case "漢文":
                    return [
                        "訓読","書き下し",
                        "再読文字",
                        "否定形",
                        "句法",
                        "疑問形","反語形",
                        "過去形","敬語",
                        "読解"
                    ]
                    break;
                case "現代文":
                    return [
                        "小説",
                        "漢字",
                        "現代文",
                        "記述",
                        "評論",
                    ]
                    break;
                case "数学１":
                    return [
                        "数と式",
                        "２次関数",
                        "図形","計量",
                        "形",
                        "データの分析"
                    ];
                    break;
                case "数学A":
                    return [
                        "場合の数","確率",
                        "整数の性質",
                        "図形の性質"
                    ]
                    break;
                case "数学２":
                    return [
                        "証明",
                        "複素数",
                        "図形",
                        "三角関数",
                        "指数","対数",
                        "微分法",
                        "積分法"
                    ]
                    break;
                case "数学B":
                    return [
                        "平面ベクトル",
                        "空間ベクトル",
                        "数列",
                        "確率分布"
                    ]
                    break;
                case "数学３":
                    return [
                        "平面上の曲線",
                        "複素数平面",
                        "関数","極限",
                        "微分法",
                        "積分法"
                    ]
                    break;
                case "物理基礎":
                    return [
                        "速度","加速度",
                        "落体の運動",
                        "力の表し方","運動の法則",
                        "様々な力",
                        "仕事","力学的エネルギー",
                        "力学的エネルギー保存の法則",
                        "熱","エネルギー",
                        "波の性質",
                        "音波",
                        "電気","エネルギーの利用"
                    ];
                    break;
                case "物理":
                    return [
                        "平面内の運動と剛体にはたらく力",
                        "運動量",
                        "円運動","慣性力",
                        "単振動","万有引力",
                        "熱と物質の状態",
                        "波の性質","音波",
                        "光波",
                        "電場","電位",
                        "コンデンサー",
                        "電流",
                        "電流","磁場",
                        "電磁誘導","交流と電磁波",
                        "原子"
                    ]
                    break;
                case "化学基礎":
                    return [
                        "物質の探究",
                        "構成粒子",
                        "化学結合",
                        "結晶",
                        "物質量",
                        "量的関係",
                        "酸と塩基",
                        "中和反応","塩",
                        "酸化還元反応",
                        "電気分解"
                    ]
                    break;
                case "化学":
                    return [
                        "状態変化",
                        "気体の性質",
                        "溶液の性質",
                        "反応熱",
                        "電気分解",
                        "反応速度",
                        "化学平衡",
                        "電離平衡",
                        "非金属元素",
                        "典型金属元素",
                        "遷移元素",
                        "脂肪族化合物",
                        "芳香族化合物",
                        "合成高分子化合物",
                        "天然高分子化合物"
                    ]
                    break;
                case "生物基礎":
                    return [
                        "多様性",
                        "細胞","エネルギー",
                        "DNA",
                        "タンパク質合成","遺伝子発現",
                        "神経系","ホルモン",
                        "免疫",
                        "植生","遷移",
                        "気候","バイオーム",
                        "生態系"
                    ]
                    break;
                case "生物":
                    return [
                        "生体物質","細胞",
                        "生命現象","タンパク質",
                        "代謝",
                        "遺伝子",
                        "発現調節","バイオテクノロジー",
                        "生殖","減数分裂",
                        "動物の発生",
                        "発生のしくみ","植物の発生",
                        "動物の反応",
                        "植物の環境応答",
                        "生物群集","生態系",
                        "生物の変遷","進化",
                        "生物の系統",
                    ]
                    break;
                case "地学基礎":
                    return [
                        "地球の概観",
                        "活動する地球",
                        "岩石",
                        "地層",
                        "生命の進化",
                        "大気",
                        "海水の運動",
                        "天気","災害",
                        "恒星",
                        "太陽の進化"
                    ]
                    break;
                case "科学と人間生活":
                    return [
                        "植物の環境応答",
                        "植生と遷移"
                    ]
                    break;
                case "世界史":
                    return [
                        "先史","古代オリエント","古代地中海",
                        "ローマ","キリスト教",
                        "古代アジア",
                        "イスラーム",
                        "ヨーロッパ",
                        "十字軍",
                        "アジア",
                        "市民革命","ウィーン体制",
                        "19世紀",
                        "アジアの植民地化",
                        "帝国主義","アジアの民族運動",
                        "第一次世界大戦","ヴェルサイユ体制",
                        "世界恐慌","第二次世界大戦",
                        "東西冷戦",
                        "主権国家体制","市民革命",
                        "アメリカの繁栄","世界恐慌",
                        "中国国民革命","日中戦争"
                    ];
                    break;
                case "日本史":
                    return [
                        "旧石器時代","縄文時代","弥生時代","古墳時代",
                        "飛鳥時代",
                        "奈良時代",
                        "平安時代",
                        "鎌倉時代",
                        "室町時代",
                        "安土桃山時代",
                        "江戸時代",
                        "明治時代",
                        "大正時代",
                        "昭和時代",
                        "織豊政権",
                        "江戸幕府",
                        "幕藩体制",
                        "明治政府",
                        "立憲国家",
                        "条約改正","日清戦争",
                        "日露戦争","資本主義",
                        "第一次世界大戦",
                        "恐慌","太平洋戦争",
                        "占領下",
                        "独立後",
                        "現代",
                        "院政期",
                        "幕末",
                    ];
                case "地理":
                    return [
                        "地球","地図",
                        "気候",
                        "日本と世界",
                        "産業",
                        "エネルギー","食料問題",
                        "交通","通信","貿易",
                        "人口","村落","都市",
                        "生活文化","国家の結びつき","民族","領土",
                        "東アジア","東南アジア",
                        "南アジア","西アジア","中央アジア","アフリカ",
                        "ヨーロッパ，","ロシア",
                        "南北アメリカ","オセアニア",
                        "気候",
                        "地形図","地域調査","地形",
                    ];
                case "倫理":
                    return [
                        "青年期","ギリシャ思想",
                        "キリスト教","イスラーム",
                        "仏教","中国の思想",
                        "日本の風土","伝統思想","日本の仏教",
                        "江戸時代","近現代",
                        "人間の尊厳","科学技術",
                        "社会契約説","ドイツ観念論",
                        "功利主義","プラグマティズム","社会主義",
                        "現代の思想",
                        "鎌倉仏教",
                        "ドイツ観念論"
                    ];
                case "現代社会":
                    return [
                        "社会","青年期","自己形成",
                        "現代の経済社会",
                        "日本経済",
                        "労働問題","社会保障",
                        "日本国憲法",
                        "国会","内閣","裁判所",
                        "地方自治","政党","選挙",
                        "国際政治",
                        "現代国家","民主政治",
                        "裁判所",
                        "資本主義経済","社会主義経済",
                        "財政",
                        "日本経済の発展","産業構造の変化",
                        "地域的経済統合","経済のグローバル化"
                    ];
                    break;
                case "英語":
                    return [
                        "文の種類",
                        "文型",
                        "時制",
                        "助動詞",
                        "受動態",
                        "不定詞",
                        "分詞",
                        "動名詞",
                        "関係詞",
                        "比較",
                        "仮定法",
                        "時制の一致",
                        "前置詞",
                        "接続詞",
                        "特殊な構文",
                        "同格のthat",
                        "名詞と冠詞"
                    ];
                    break;
                case "社会と情報":
                    return [
                        "私たちを取り巻く情報",
                        "アナログからデジタルへ",
                        "表現と伝達",
                        "インターネット"
                    ];
                    break;
                case "情報の科学":
                    return [
                        "コンピュータ",
                        "仕組みとシステム",
                        "問題解決",
                        "ネットワーク","データベース",
                        "情報技術"
                    ];
                    break;
                case "家庭基礎":
                    return [
                        //家庭基礎
                        "人の一生と家族・福祉",
                        "食生活の管理と健康",
                        "衣生活の管理と健康",
                        "住生活の管理と健康",
                        "消費生活と環境"
                    ];
                    break;
                case "家庭総合":
                    return [
                        "家族",
                        "子ども",
                        "多様性",
                        "高齢者",
                        "共生",
                        "経済生活","環境",
                        "災害",
                        "食生活",
                        "衣生活"
                    ];
                    break;
                case "生活デザイン":
                    return [
                        "衣生活",
                        "住生活",
                        "コミュニケーション",
                        "デジタルコンテンツ",
                        "地域社会",
                        "園芸",
                        "ビジネス"
                    ];
                    break;
                case "音楽":
                    return [
                        "音楽の知識",
                        "合唱",
                        "楽器"
                    ];
                    break;
                case "美術":
                    return [
                        "器具",
                        "表現活動",
                        "工芸",
                        "ものづくり"
                    ];
                    break;
                case "体育":
                    return [
                        "球技",
                        "水泳",
                        "体操",
                        "卓上",
                        "陸上",
                        "ダンス"
                    ];
                    break;
                case "保健":
                    return [
                        "健康",
                        "体育理論",
                        "生涯",
                        "社会生活"
                    ];
                    break;
                case "書道":
                    return [
                        "漢字",
                        "仮名",
                        "篆刻","刻字"
                    ];
                    break;
        }
        break;
    }
}

function setColor(subject, length, i) {
    let r = 1;
    let g = 1;
    let b = 1;
    let change = 40 / length;

    switch(subject) {
        case "国語":
            r = 224;
            g = 122;
            b = 28;
            break;
        case "算数":
        case "数学":203,114,171
            r = 203;
            g = 114;
            b = 171;
            break;
        case "社会":223,124,87
            r = 223;
            g = 124;
            b = 87;
            break;
        case "理科":
            r = 33;
            g = 172;
            b = 176;
            break;
        case "音楽":
            r = 83;
            g = 183;
            b = 211;
            break;
        case "美術":
            r = 204;
            g = 94;
            b = 144;
            break;
        case "技術":
        case "図工":
            r = 94;
            g = 159;
            b = 208;
            break;
        case "保健":
            r = 71;
            g = 170;
            b = 209;
            break;
        case "体育":
            r = 169;
            g = 125;
            b = 60;
            break;
        case "家庭":
            r = 133;
            g = 184;
            b = 57;
            break;
        case "生活":
            r = 198;
            g = 204;
            b = 102;
            break;
        case "英語":
            r = 155;
            g = 127;
            b = 177;
            break;
        case "道徳":
            r = 167;
            g = 120;
            b = 116;
            break;
        case "総合":
            r = 102;
            g = 94;
            b = 208;
            break;
        case "特活":
            r = 211;
            g = 211;
            b = 211;
            break;
        case "化学":
        case "化学基礎":
            r = 134;
            g = 211;
            b = 83;
            break;
        case "家庭基礎":
        case "家庭総合":
            r = 211;
            g = 83;
            b = 185;
            break;
        case "漢文":
            r = 211;
            g = 137;
            b = 83;
            break;
        case "現代社会":
            r = 131;
            g = 83;
            b = 211;
            break;
        case "現代文":
            r = 211;
            g = 176;
            b = 83;
            break;
        case "古文":
            r = 211;
            g = 83;
            b = 83;
            break;
        case "公民":
            r = 83;
            g = 191;
            b = 211;
            break;
        case "社会と情報":
            r = 83;
            g = 92;
            b = 211;
            break;
        case "書道":
            r = 211;
            g = 155;
            b = 83;
            break;
        case "情報の科学":
            r = 83;
            g = 149;
            b = 211;
            break;
        case "数学１":
            r = 89;
            g = 83;
            b = 211;
            break;
        case "数学A":
            r = 200;
            g = 211;
            b = 83;
            break;
        case "数学２":
            r = 83;
            g = 116;
            b = 211;
            break;
        case "数学B":
            r = 211;
            g = 194;
            b = 83;
            break;
        case "数学３":
            r = 83;
            g = 161;
            b = 211;
            break;
        case "世界史":
            r = 211;
            g = 83;
            b = 131;
            break;
        case "生活デザイン":
            r = 173;
            g = 83;
            b = 211;
            break;
        case "生物":
        case "生物基礎":
            r = 83;
            g = 211;
            b = 131;
            break;
        case "地学":
        case "地学基礎":
            r = 128;
            g = 211;
            b = 83;
            break;
        case "地理":
            r = 164;
            g = 211;
            b = 83;
            break;
        case "日本史":
            r = 211
            g = 83
            b = 83
            break;
        case "物理":
        case "物理基礎":
            r = 83;
            g = 211;
            b = 125;
            break;
        case "倫理":
            r = 211;
            g = 107;
            b = 83;
            break;
        case "歴史":
            r = 83;
            g = 211;
            b = 191;
            break;
    }
    return "rgb(" + (r + i * change) + "," + (g + i * change) + "," + (b + i * change) + ")";
}

function subjectData(grade) {
    switch(grade) {
        case "第1学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#算数').removeClass('close');
            $('.subject-modal').find('#生活').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#図工').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "第2学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#算数').removeClass('close');
            $('.subject-modal').find('#生活').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#図工').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "第3学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#算数').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#社会').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#図工').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "第4学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#算数').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#社会').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#図工').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "第5学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#算数').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#社会').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#家庭').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#図工').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "第6学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#算数').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#社会').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#家庭').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#図工').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "中学校第1学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#数学').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#地理').removeClass('close');
            $('.subject-modal').find('#歴史').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#技術').removeClass('close');
            $('.subject-modal').find('#家庭').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#美術').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "中学校第2学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#数学').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#地理').removeClass('close');
            $('.subject-modal').find('#歴史').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#技術').removeClass('close');
            $('.subject-modal').find('#家庭').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#美術').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "中学校第3学年":
            $('.subject-modal').find('#国語').removeClass('close');
            $('.subject-modal').find('#数学').removeClass('close');
            $('.subject-modal').find('#理科').removeClass('close');
            $('.subject-modal').find('#歴史').removeClass('close');
            $('.subject-modal').find('#公民').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#技術').removeClass('close');
            $('.subject-modal').find('#家庭').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#美術').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            $('.subject-modal').find('#道徳').removeClass('close');
            break;
        case "高等学校":
            $('.subject-modal').find('#古文').removeClass('close');
            $('.subject-modal').find('#漢文').removeClass('close');
            $('.subject-modal').find('#現代文').removeClass('close');
            $('.subject-modal').find('#数学１').removeClass('close');
            $('.subject-modal').find('#数学A').removeClass('close');
            $('.subject-modal').find('#数学２').removeClass('close');
            $('.subject-modal').find('#数学B').removeClass('close');
            $('.subject-modal').find('#数学３').removeClass('close');
            $('.subject-modal').find('#物理基礎').removeClass('close');
            $('.subject-modal').find('#物理').removeClass('close');
            $('.subject-modal').find('#化学基礎').removeClass('close');
            $('.subject-modal').find('#化学').removeClass('close');
            $('.subject-modal').find('#生物基礎').removeClass('close');
            $('.subject-modal').find('#生物').removeClass('close');
            $('.subject-modal').find('#地学基礎').removeClass('close');
            $('.subject-modal').find('#科学と人間生活').removeClass('close');
            $('.subject-modal').find('#世界史').removeClass('close');
            $('.subject-modal').find('#日本史').removeClass('close');
            $('.subject-modal').find('#地理').removeClass('close');
            $('.subject-modal').find('#倫理').removeClass('close');
            $('.subject-modal').find('#現代社会').removeClass('close');
            $('.subject-modal').find('#英語').removeClass('close');
            $('.subject-modal').find('#社会と情報').removeClass('close');
            $('.subject-modal').find('#情報の科学').removeClass('close');
            $('.subject-modal').find('#家庭基礎').removeClass('close');
            $('.subject-modal').find('#家庭総合').removeClass('close');
            $('.subject-modal').find('#生活デザイン').removeClass('close');
            $('.subject-modal').find('#音楽').removeClass('close');
            $('.subject-modal').find('#美術').removeClass('close');
            $('.subject-modal').find('#体育').removeClass('close');
            $('.subject-modal').find('#保健').removeClass('close');
            $('.subject-modal').find('#書道').removeClass('close');
            break;
    }
}